tiborsimon/embedded-tdd-headers/pic/pic16/pic16c926_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16C926_H_
#define _PIC16C926_H_

#define STATUS                        0
#define C                             1
#define CARRY                         2
#define DC                            3
#define ZERO                          4
#define Z                             5
#define nPD                           6
#define nTO                           7
#define RP0                           8
#define RP                            9
#define RP1                           10
#define IRP                           11
#define PORTA                         12
#define RA0                           13
#define RA1                           14
#define RA2                           15
#define RA3                           16
#define RA4                           17
#define RA5                           18
#define PORTB                         19
#define RB0                           20
#define RB1                           21
#define RB2                           22
#define RB3                           23
#define RB4                           24
#define RB5                           25
#define RB6                           26
#define RB7                           27
#define PORTC                         28
#define RC0                           29
#define RC1                           30
#define RC2                           31
#define RC3                           32
#define RC4                           33
#define RC5                           34
#define PORTD                         35
#define RD0                           36
#define RD1                           37
#define RD2                           38
#define RD3                           39
#define RD4                           40
#define RD5                           41
#define RD6                           42
#define RD7                           43
#define PORTE                         44
#define RE0                           45
#define RE1                           46
#define RE2                           47
#define RE3                           48
#define RE4                           49
#define RE5                           50
#define RE6                           51
#define RE7                           52
#define INTCON                        53
#define RBIF                          54
#define INTF                          55
#define T0IF                          56
#define TMR0IF                        57
#define RBIE                          58
#define INTE                          59
#define T0IE                          60
#define TMR0IE                        61
#define PEIE                          62
#define GIE                           63
#define PIR1                          64
#define TMR1IF                        65
#define TMR2IF                        66
#define CCP1IF                        67
#define SSPIF                         68
#define ADIF                          69
#define LCDIF                         70
#define T1CON                         71
#define TMR1ON                        72
#define TMR1CS                        73
#define nT1SYNC                       74
#define T1INSYNC                      75
#define T1OSCEN                       76
#define T1CKPS0                       77
#define T1CKPS                        78
#define T1CKPS1                       79
#define T2CON                         80
#define T2CKPS0                       81
#define T2CKPS                        82
#define T2CKPS1                       83
#define TMR2ON                        84
#define TOUTPS0                       85
#define TOUTPS                        86
#define TOUTPS1                       87
#define TOUTPS2                       88
#define TOUTPS3                       89
#define SSPCON                        90
#define SSPM0                         91
#define SSPM                          92
#define SSPM1                         93
#define SSPM2                         94
#define SSPM3                         95
#define CKP                           96
#define SSPEN                         97
#define SSPOV                         98
#define WCOL                          99
#define CCP1CON                       100
#define CCP1M0                        101
#define CCP1M                         102
#define CCP1M1                        103
#define CCP1M2                        104
#define CCP1M3                        105
#define CCP1Y                         106
#define DC1B                          107
#define CCP1X                         108
#define ADCON0                        109
#define ADON                          110
#define nDONE                         111
#define GO_nDONE                      112
#define GO_DONE                       113
#define GO                            114
#define CHS                           115
#define CHS0                          116
#define CHS1                          117
#define CHS2                          118
#define ADCS                          119
#define ADCS0                         120
#define ADCS1                         121
#define OPTION_REG                    122
#define PS                            123
#define PS0                           124
#define PS1                           125
#define PS2                           126
#define PSA                           127
#define T0SE                          128
#define T0CS                          129
#define INTEDG                        130
#define nRBPU                         131
#define TRISA                         132
#define TRISA0                        133
#define TRISA1                        134
#define TRISA2                        135
#define TRISA3                        136
#define TRISA4                        137
#define TRISA5                        138
#define TRISB                         139
#define TRISB0                        140
#define TRISB1                        141
#define TRISB2                        142
#define TRISB3                        143
#define TRISB4                        144
#define TRISB5                        145
#define TRISB6                        146
#define TRISB7                        147
#define TRISC                         148
#define TRISC0                        149
#define TRISC1                        150
#define TRISC2                        151
#define TRISC3                        152
#define TRISC4                        153
#define TRISC5                        154
#define TRISD                         155
#define TRISD0                        156
#define TRISD1                        157
#define TRISD2                        158
#define TRISD3                        159
#define TRISD4                        160
#define TRISD5                        161
#define TRISD6                        162
#define TRISD7                        163
#define TRISE                         164
#define TRISE0                        165
#define TRISE1                        166
#define TRISE2                        167
#define TRISE3                        168
#define TRISE4                        169
#define PSPMODE                       170
#define TRISE5                        171
#define IBOV                          172
#define OBF                           173
#define TRISE6                        174
#define IBF                           175
#define TRISE7                        176
#define PIE1                          177
#define TMR1IE                        178
#define TMR2IE                        179
#define CCP1IE                        180
#define SSPIE                         181
#define ADIE                          182
#define LCDIE                         183
#define PCON                          184
#define nBOR                          185
#define nPOR                          186
#define SSPSTAT                       187
#define BF                            188
#define UA                            189
#define R_nW                          190
#define READ_WRITE                    191
#define I2C_READ                      192
#define nW                            193
#define R                             194
#define nWRITE                        195
#define R_W                           196
#define S                             197
#define I2C_START                     198
#define I2C_STOP                      199
#define P                             200
#define nA                            201
#define D_A                           202
#define D_nA                          203
#define D                             204
#define DATA_ADDRESS                  205
#define nADDRESS                      206
#define I2C_DATA                      207
#define CKE                           208
#define SMP                           209
#define ADCON1                        210
#define PCFG0                         211
#define PCFG                          212
#define PCFG1                         213
#define PCFG2                         214
#define PCFG3                         215
#define ADFM                          216
#define PORTF                         217
#define RF0                           218
#define RF1                           219
#define RF2                           220
#define RF3                           221
#define RF4                           222
#define RF5                           223
#define RF6                           224
#define RF7                           225
#define PORTG                         226
#define RG0                           227
#define RG1                           228
#define RG2                           229
#define RG3                           230
#define RG4                           231
#define RG5                           232
#define RG6                           233
#define RG7                           234
#define PMCON1                        235
#define RD                            236
#define LCDSE                         237
#define SE0                           238
#define SE5                           239
#define SE9                           240
#define SE12                          241
#define SE16                          242
#define SE20                          243
#define SE27                          244
#define SE29                          245
#define LCDPS                         246
#define LP                            247
#define LP0                           248
#define LP1                           249
#define LP2                           250
#define LP3                           251
#define LCDCON                        252
#define LMUX0                         253
#define LMUX                          254
#define LMUX1                         255
#define CS                            256
#define CS0                           257
#define CS1                           258
#define BIAS                          259
#define VGEN                          260
#define WERR                          261
#define SLPEN                         262
#define LCDEN                         263
#define LCDD00                        264
#define LCDD00_SEG00                  265
#define LCDD00_SEG01                  266
#define LCDD00_SEG02                  267
#define LCDD00_SEG03                  268
#define LCDD00_SEG04                  269
#define LCDD00_SEG05                  270
#define LCDD00_SEG06                  271
#define LCDD00_SEG07                  272
#define LCDD01                        273
#define LCDD01_SEG08                  274
#define LCDD01_SEG09                  275
#define LCDD01_SEG10                  276
#define LCDD01_SEG11                  277
#define LCDD01_SEG12                  278
#define LCDD01_SEG13                  279
#define LCDD01_SEG14                  280
#define LCDD01_SEG15                  281
#define LCDD02                        282
#define LCDD02_SEG16                  283
#define LCDD02_SEG17                  284
#define LCDD02_SEG18                  285
#define LCDD02_SEG19                  286
#define LCDD02_SEG20                  287
#define LCDD02_SEG21                  288
#define LCDD02_SEG22                  289
#define LCDD02_SEG23                  290
#define LCDD03                        291
#define LCDD03_SEG24                  292
#define LCDD03_SEG25                  293
#define LCDD03_SEG26                  294
#define LCDD03_SEG27                  295
#define LCDD03_SEG28                  296
#define LCDD03_SEG29                  297
#define LCDD03_SEG30                  298
#define LCDD03_SEG31                  299
#define LCDD04                        300
#define LCDD04_SEG00                  301
#define LCDD04_SEG01                  302
#define LCDD04_SEG02                  303
#define LCDD04_SEG03                  304
#define LCDD04_SEG04                  305
#define LCDD04_SEG05                  306
#define LCDD04_SEG06                  307
#define LCDD04_SEG07                  308
#define LCDD05                        309
#define LCDD05_SEG08                  310
#define LCDD05_SEG09                  311
#define LCDD05_SEG10                  312
#define LCDD05_SEG11                  313
#define LCDD05_SEG12                  314
#define LCDD05_SEG13                  315
#define LCDD05_SEG14                  316
#define LCDD05_SEG15                  317
#define LCDD06                        318
#define LCDD06_SEG16                  319
#define LCDD06_SEG17                  320
#define LCDD06_SEG18                  321
#define LCDD06_SEG19                  322
#define LCDD06_SEG20                  323
#define LCDD06_SEG21                  324
#define LCDD06_SEG22                  325
#define LCDD06_SEG23                  326
#define LCDD07                        327
#define LCDD07_SEG24                  328
#define LCDD07_SEG25                  329
#define LCDD07_SEG26                  330
#define LCDD07_SEG27                  331
#define LCDD07_SEG28                  332
#define LCDD07_SEG29                  333
#define LCDD07_SEG30                  334
#define LCDD07_SEG31                  335
#define LCDD08                        336
#define LCDD08_SEG00                  337
#define LCDD08_SEG01                  338
#define LCDD08_SEG02                  339
#define LCDD08_SEG03                  340
#define LCDD08_SEG04                  341
#define LCDD08_SEG05                  342
#define LCDD08_SEG06                  343
#define LCDD08_SEG07                  344
#define LCDD09                        345
#define LCDD09_SEG08                  346
#define LCDD09_SEG09                  347
#define LCDD09_SEG10                  348
#define LCDD09_SEG11                  349
#define LCDD09_SEG12                  350
#define LCDD09_SEG13                  351
#define LCDD09_SEG14                  352
#define LCDD09_SEG15                  353
#define LCDD10                        354
#define LCDD10_SEG16                  355
#define LCDD10_SEG17                  356
#define LCDD10_SEG18                  357
#define LCDD10_SEG19                  358
#define LCDD10_SEG20                  359
#define LCDD10_SEG21                  360
#define LCDD10_SEG22                  361
#define LCDD10_SEG23                  362
#define LCDD11                        363
#define LCDD11_SEG24                  364
#define LCDD11_SEG25                  365
#define LCDD11_SEG26                  366
#define LCDD11_SEG27                  367
#define LCDD11_SEG28                  368
#define LCDD11_SEG29                  369
#define LCDD11_SEG30                  370
#define LCDD11_SEG31                  371
#define LCDD12                        372
#define LCDD12_SEG00                  373
#define LCDD12_SEG01                  374
#define LCDD12_SEG02                  375
#define LCDD12_SEG03                  376
#define LCDD12_SEG04                  377
#define LCDD12_SEG05                  378
#define LCDD12_SEG06                  379
#define LCDD12_SEG07                  380
#define LCDD13                        381
#define LCDD13_SEG08                  382
#define LCDD13_SEG09                  383
#define LCDD13_SEG10                  384
#define LCDD13_SEG11                  385
#define LCDD13_SEG12                  386
#define LCDD13_SEG13                  387
#define LCDD13_SEG14                  388
#define LCDD13_SEG15                  389
#define LCDD14                        390
#define LCDD14_SEG16                  391
#define LCDD14_SEG17                  392
#define LCDD14_SEG18                  393
#define LCDD14_SEG19                  394
#define LCDD14_SEG20                  395
#define LCDD14_SEG21                  396
#define LCDD14_SEG22                  397
#define LCDD14_SEG23                  398
#define LCDD15                        399
#define LCDD15_SEG24                  400
#define LCDD15_SEG25                  401
#define LCDD15_SEG26                  402
#define LCDD15_SEG27                  403
#define LCDD15_SEG28                  404
#define LCDD15_SEG29                  405
#define LCDD15_SEG30                  406
#define LCDD15_SEG31                  407
#define TRISF                         408
#define TRISF0                        409
#define TRISF1                        410
#define TRISF2                        411
#define TRISF3                        412
#define TRISF4                        413
#define TRISF5                        414
#define TRISF6                        415
#define TRISF7                        416
#define TRISG                         417
#define TRISG0                        418
#define TRISG1                        419
#define TRISG2                        420
#define TRISG3                        421
#define TRISG4                        422
#define TRISG5                        423
#define TRISG6                        424
#define TRISG7                        425

#endif // _PIC16C926_H_
